Tekla Open API Reference for Tekla Structures 2025
ChangeData.Object Property
 Gets the changed object.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ModelObject Object { get; }
Public ReadOnly Property Object As ModelObject
	Get
Property Value
Type: ModelObject
See Also
Reference
ChangeData Class
Tekla.Structures.Model Namespace